// src/i18n.js
import i18n from 'i18next';
import { initReactI18next } from 'react-i18next';
import LanguageDetector from 'i18next-browser-languagedetector';
import { Message } from 'rsuite';

i18n
    .use(LanguageDetector)
    .use(initReactI18next)
    .init({
        resources: {
            th: {
                common: {
                    //img
                    imageMessage1: '/images/Message/th1.png',
                    imageMessage2: '/images/Message/th2.png',
                    // Navigation and Common UI Elements
                    home: "หน้าแรก",
                    strengths: "จุดแข็งเรื่องแม่พิมพ์",
                    about: "เกี่ยวกับบริษัท",
                    message: "สารจากผู้บริหาร",
                    aboutCompany: "เกี่ยวกับบริษัทฯ",
                    companyHistory: "ประวัติบริษัทฯ",
                    overseasBranches: "สาขาในต่างประเทศ",
                    services: "บริการของเรา",
                    recruitment: "การรับสมัครงาน",
                    business: "ธุรกิจของเรา",
                    dieCasting: "แม่พิมพ์ฉีดอลูมิเนียม",
                    machinery: "เครื่องจักรและอุปกรณ์",
                    arcana: "ARCANA",
                    ecoCylinder: "บริการ Eco Cylinder",
                    contact: "ติดต่อเรา",
                    faq: "คำถาม",
                    welcome: "ยินดีต้อนรับสู่เว็บไซต์บริษัทของเรา",
                    language: "ภาษา",
                    slogan: "ก้าวสู่อนาคตด้วยแม่พิมพ์",
                    tagline: "สร้างจินตนาการให้เป็นรูปธรรม！ตื่นตัวรับสิ่งที่เกิดขึ้นในอนาคต！",
                    subTagline: "บริษัทเรา ไม่เพียงผลิตแม่พิมพ์ที่มีประสิทธิภาพและคุณภาพสูงเท่านั้น ยังมุ่งเน้นการสร้างสรรค์แนวคิดของลูกค้าให้ก่อเกิดเป็นชิ้นงาน และมุ่งสู่อนาคตอย่างเต็มกำลัง",

                    // Hero Section
                    hero_h1: "ก้าวสู่อนาคตด้วยแม่พิมพ์",
                    hero_h2: "คุณมีสินค้าค้างสต็อกที่ซื้อมา",
                    hero_h2_sub: "แต่ไม่ได้ใชักันแล้วอยู่บ้างไหม?",
                    hero_h3: "ARCANA（อาร์คาน่า）",
                    hero_h3_sub: "อี คอมเมิร์ซยุคใหม่ ที่จะมาพลิกโฉมอุตสาหกรรมการผลิต",

                    // Section 1
                    sec1H1: "สร้างจินตนาการให้เป็นรูปธรรม！ ตื่นตัวรับสิ่งที่เกิดขึ้นในอนาคต！",
                    sec1T1: "บริษัทเรา ไม่เพียงผลิตแม่พิมพ์ที่มีประสิทธิภาพและคุณภาพสูงเท่านั้น ยังมุ่งเน้นการสร้างสรรค์แนวคิดของลูกค้าให้ก่อเกิดเป็นชิ้นงาน และมุ่งสู่อนาคตอย่างเต็มกำลัง",
                    sec1b1h1: "กิจการแม่พิมพ์",
                    sec1b1h2: "ARCANA",
                    sec1b1h3: "บริการ Eco Cylinder",
                    sec1b1s1: "รับออกแบบและผลิตแม่พิมพ์ที่มีประสิทธิภาพ คุณภาพ และความแม่นยำสูง สำหรับชิ้นส่วนยานยนต์และรถจักรยานยนต์เป็นหลัก",
                    sec1b1s2: "เราดำเนินการเว็บไซต์อีคอมเมิร์ซ \"ARCANA\" ที่สามารถซื้อขายผลิตภัณฑ์อุตสาหกรรม และอื่นๆ ได้",
                    sec1b1s3: "บริการปรับปรุงและพัฒนาชิ้นส่วนเพื่อให้เป็นมิตรต่อสิ่งแวดล้อม",
                    sec1H2: "จุดแข็งของเรา",
                    sec1T2: "บริษัทของเรามีความเชี่ยวชาญในการออกแบบและผลิตแม่พิมพ์ฉีดอลูมิเนียมมาตรฐานสากล ด้วยเทคโนโลยีล้ำสมัยและกระบวนการที่เน้นคุณภาพสูงสุด เรามีทีม Design มืออาชีพที่ออกแบบแม่พิมพ์ตามความต้องการ พร้อมแนะนำฟังก์ชันที่เหมาะสม รองรับการผลิตตั้งแต่ 135t ถึง 2500t ด้วยประสบการณ์กว่า 30 ปีและทีมงานผู้เชี่ยวชาญ เรามุ่งมั่นตอบสนองความต้องการและสร้างความพึงพอใจสูงสุดให้กับลูกค้า",

                    // Section 2
                    sec2b1h1: "การดำเนินการเพื่อเพิ่มประสิทธิภาพการผลิต",
                    sec2b1h2: "การให้คำแนะนำ VA/VE อย่างเต็มที่",
                    sec2b1h3: "พร้อมจัดจำหน่ายทั่วโลก",
                    sec2b1s1: "เราพร้อมให้ความร่วมมือกับลูกค้า เพื่อเพิ่มประสิทธิภาพการผลิตและพร้อมที่จะตอบสนองความต้องการของลูกค้าทุกท่านไม่ว่าจะเป็น การลดระยะเวลา และลดขั้นตอนในการผลิต รวมถึงการลดการแก้ไขต่างๆ ให้น้อยที่สุด เป็นต้น",
                    sec2b1s2: "ด้วยประสบการณ์และผลงานที่ผ่านมามากมายเราพร้อมช่วยแก้ไขปัญหา VA (Value Analysis) และ VE (Value Engineering) ของลูกค้าอย่างเต็มที่",
                    sec2b1s3: "ไม่เพียงแค่ในไทย เรายังมีฐานการผลิตอยู่ที่ ญี่ปุ่น และ เม็กซิโก ทำให้เราสามารถตอบรับความต้องการจากลูกค้าทั่วโลกได้ (ประวัติการส่งออก: ญี่ปุ่น สหรัฐอเมริกา ฟิลิปปินส์ เวียดนาม อินเดีย และเม็กซิโก)",

                    // Section 3 - Recruitment
                    recruitH1: "แนะนำเกี่ยวกับการรับสมัครงานของ SAMT",
                    recruits1: "ตำแหน่งงานที่เปิดรับ",

                    // Strengths
                    st_h1: "เทคโนโลยีผลิตแม่พิมพ์ความแม่นยำสูง",
                    st_h2: "กำลังการผลิตแม่พิมพ์ขนาดใหญ่",
                    st_h3: "พัฒนาผลิตภัณฑ์ตามยุคตามสมัย",
                    st_des1: "ผู้ผลิตชิ้นส่วนรถยนต์รายใหญ่มีความต้องการคุณภาพการผลิตที่แม่นยำเป็นอย่างมาก และเพื่อให้เป็นไปตามข้อกำหนดด้านความแม่นยำ เราจึงผลิตด้วยทักษะและเทคโนโลยีการผลิตแม่พิมพ์ที่ดีที่สุด ที่ได้ทำมาอย่างต่อเนื่องและยาวนาน",
                    st_des2: "เรามีการติดตั้งเครื่องจักรและอุปกรณ์ขนาดใหญ่และประสิทธิภาพสูง ทำให้สามารถจัดการงานที่ต้องใช้ความแม่นยำสูงได้อย่างความรวดเร็ว เราสามารถจัดการชิ้นงานตั้งแต่ Φ3 มม. (ความลึก600 มม.) ถึง Φ20 มม. (ความลึก 1000 มม.) และยังสามารถทำรูปทรง SR ส่วนปลายได้ด้วย",
                    st_des3: "เรายินดีนำเสนอในส่วนของการผลิตแม่พิมพ์แบบใหม่ด้วยเทคโนโลยีการผลิตแม่พิมพ์ที่เชื่อถือได้ ให้เป็นรูปทรงตามแบบที่ลูกค้าต้องการ เพื่อท้าทายความสามารถของเราต่อไป",
                    high_quality: "คุณภาพสูง",
                    low_price: "ราคาประหยัด",
                    ontime: "ส่งมอบตรงเวลา",
                    numberOne: "สู่การเป็นผู้ผลิตแม่พิมพ์ฉีดอลูมิเนียม อันดับ 1 ในแถบเอเชียตะวันออกเฉียงใต้ ด้วยคุณภาพ ราคาประหยัด และส่งมอบตรงเวลา",


                },
            },
            en: {
                common: {
                    //img
                    imageMessage1: '/images/Message/en1.png',
                    imageMessage2: '/images/Message/en2.png',
                    // Navigation and Common UI Elements
                    home: "Home",
                    strengths: "Strengths of SHIPPO moulds",
                    about: "About Us",
                    message: "Message",
                    aboutCompany: "About the Company",
                    services: "Service",
                    companyHistory: "Company History",
                    recruitment: "Recruitment",
                    overseasBranches: "Overseas Branches",
                    business: "Own Business",
                    dieCasting: "Die Casting moulds",
                    machinery: "Machinery and Equipment",
                    arcana: "ARCANA",
                    ecoCylinder: "Cylinder Services",
                    contact: "Contact Us",
                    faq: "FAQ",
                    welcome: "Welcome to our company website",
                    language: "Language",
                    slogan: "Pioneering the future through mould technology",
                    tagline: "Bringing Imagination to Life! Excitement for the Future!",
                },
            },
            jp: {
                common: {

                    sec2b1h1: "生産性向上への取り組み",
                    sec2b1h2: "積極的なVA/VE提案",
                    sec2b1h3: "グローバルな供給",
                    sec2b1s1: "お客様の生産性向上に一緒に取り組みます。<br>立ち上げ期間を短くしたい、<br>修正を少なくしたいなどお客様の要望に<br>お応えします。",
                    sec2b1s2: "VA・VEを積極的に数多く行ってきた実績に<br>より、お客様のお困りごとも解決いたします。",
                    sec2b1s3: "タイをはじめ日本・メキシコに拠点があり、<br>グローバルな供給が可能です。<br>（過去の輸出実績：日本・アメリカ・フィリピン・<br>ベトナム・インド・メキシコ）",

                }
            }
        },
        fallbackLng: 'th',
        debug: process.env.NODE_ENV === 'development',
        interpolation: {
            escapeValue: false
        },
        defaultNS: 'common'
    });

export default i18n;